'''
Бонусне завдання. 
Придумайте свою гру-загадку! 
Не соромтеся експериментувати з тими командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
'''

import random
print("Вітаю у грі-загадці!")
print("Завдання просте: вгадай, яке число я загадав від 1 до 10.")

secret_number = random.randint(1, 10)
attempts = 3

while attempts > 0:
    guess = int(input("Введи свою догадку: "))

    if guess == secret_number:
        print("Вірно! Ти вгадав число!")
        break
    else:
        print("Неправильно! Спробуй ще раз.")
        attempts -= 1
        print("Залишилося спроб:", attempts)

        if attempts == 0:
            print(f"На жаль, ти не вгадав. Загадане число було {secret_number}. Спробуй ще раз!")

print("Дякую за гру!")
