'''
Напишіть будь-який діалог з комп'ютером, який захочете!
'''

print("Привіт! Я твій розумний комп'ютерний помічник.")
name = input("Як тебе звуть? ")

print(f"Приємно познайомитися, {name}!")

age = input("Скільки тобі років? ")
age = int(age)

if age < 18:
    print("Ти ще молодий, але це не заважає бути цікавим і вивчати нове!")
else:
    print("Вже дорослий! Важливо залишатися цікавим та навчатися протягом усього життя.")

hobby = input("Розкажи мені про своє хобі. Що тобі подобається робити у вільний час? ")

print(f"Цікаве хобі, {name}! Відмінно, що ти займаєшся чимось, що приносить тобі радість.")

print("Я завжди тут, щоб допомогти тобі. Якщо у тебе є які-небудь питання, не соромся запитати!")

print("До побачення, і нехай твій день буде чудовим!")
