'''
Бонусне завдання. 
Придумайте свій чат-бот! 
Не соромтеся експериментувати з командами, які Ви вже знаєте!
Обов'язково придумайте і використовуйте свою власну ідею! 
'''

import random

recipes = {
    "паста": ["макарони", "соус", "пармезан"],
    "омлет": ["яйця", "молоко", "сіль", "перець", "олія"],
    "салат": ["листя салату", "помідори", "огірки", "оливкова олія", "сіль"]
    # Додайте інші рецепти за вашим бажанням
}

print("Привіт! Я CookBot, твій асистент для кулінарії. Якщо ти шукаєш рецепт, просто запитай мене!")

while True:
    user_input = input("салат, омлет, паста, вихід ")
    if user_input in ['вихід']:
        print("До побачення! Смачного!")
        break

    ingredients = recipes.get(user_input, [])
    
    if ingredients:
        random.shuffle(ingredients)
        print(f"Рецепт для {user_input.capitalize()}:\nІнгредієнти: {', '.join(ingredients)}.\nЩасливого готування!")
        break
    else:
        print("Вибачте, але рецепт для цього блюда відсутній. Спробуйте інше блюдо!")
