'''
Заведіть змінну answer і запишіть туди правильну відповідь.
Використовуйте функцію input, щоб загадати загадку користувачеві
і записати його відповідь в нову змінну.

В умовному операторі порівняйте відповідь користувача з answer. 
Якщо відповідь вірна, то привітайте користувача з правильною відповідю. 
Якщо немає - висловіть співчуття.
'''

загадка = "Що це за предмет: завжди йде вперед, але ніколи не йде назад?"

answer = "годинник"

print("Відгадай загадку: " + загадка)

ваша_відповідь = input()

if ваша_відповідь.lower() == answer.lower():
    print("Вірно! Ви просто геній!")
else:
    print("Неправильно. Спробуйте ще раз. Правильна відповідь: " + answer)
