'''
Змініть минулу програму так, щоб вона тривала до тих пір, 
поки не буде дана правильна відповідь. 
Для цього умова має бути не в умовному операторі, а в циклі while.
'''
загадка = "Що це за предмет: завжди йде вперед, але ніколи не йде назад?"

answer = "годинник"

while True:
    print("Відгадай загадку: " + загадка)

    ваша_відповідь = input()

    if ваша_відповідь.lower() == answer.lower():
        print("Вірно! Ви просто геній!")
    else:
        print("Неправильно. Спробуйте ще раз. Правильна відповідь: " + answer)
