'''
Більшість років мають 365 днів. 
Однак час, необхідний Землі для обертання навколо Сонця, насправді трохи більше. 
В результаті в деякі роки включається додатковий день, 29 лютого,
щоб виправити цю різницю. Такі роки називають високосними. 
Правила визначення того, високосний рік чи ні, дотримуються:

Будь-який рік, який ділиться на 400, є високосним.
З решти років будь-який рік, який ділиться на 100, не є високосним.
З решти років будь-який рік, який ділиться на 4, є високосним.
Всі інші роки - не високосні.
Напишіть програму, яка читає рік від користувача і виводить повідомлення про те, 
високосний це рік чи ні.

'''

рік = int(input("Введіть рік: "))

if (рік % 400 == 0) or (рік % 4 == 0 and рік % 100 != 0):
    print(f"{рік} рік є високосним.")
else:
    print(f"{рік} рік не є високосним.")
