'''
Найбільшим спільним дільником двох натуральних чисел, n і m, 
є найбільше число, d, яке ділиться рівномірно як на n, так і на m. 
Існує кілька алгоритмів, які можуть бути використані для вирішення 
цього завдання.
    Напишіть програму, яка зчитує два додатніх цілих числа від користувача 
і використовує алгоритм для визначення і повідомлення їх найбільшого 
спільного дільника



'''

def знайти_нсд(a, b):
    while b:
        a, b = b, a % b
    return a

n = int(input("Введіть перше число (n): "))
m = int(input("Введіть друге число (m): "))

нсд = знайти_нсд(n, m)
print(f"Найбільший спільний дільник для {n} і {m}: {нсд}")
