'''
Напишіть програму, яка перетворює двійкове число (з основою 2) 
в десяткове (з основою 10). Ваша програма повинна починатися 
з читання двійкового числа від користувача у вигляді рядка. 
Потім слід обчислити еквівалентне десяткове число, 
обробляючи кожну цифру двійкового числа. 
Нарешті, ваша програма повинна відображати еквівалентне десяткове 
число з відповідним повідомленням.


'''

двійкове_число = input("Введіть двійкове число: ")

if not all(цифра in '01' for цифра in двійкове_число):
    print("Помилка: Введене значення не є двійковим числом.")
else:
    десяткове_число = int(двійкове_число, 2)

    print(f"Десятковий еквівалент для {двійкове_число}: {десяткове_число}")
