'''
Напишіть програму, яка визначає ім'я фігури за кількістю сторін.
Прочитайте кількість сторін від користувача, 
а потім повідомте відповідне ім'я як частину змістовного повідомлення. 
Ваша програма повинна підтримувати фігури з будь-якого місця 
від 3 до 10 сторін (і включно). 
Якщо введено кілька сторін за межами цього діапазону, 
то ваша програма повинна видати відповідне повідомлення про помилку.

'''

кількість_сторін = int(input("Введіть кількість сторін (від 3 до 10): "))

if 3 <= кількість_сторін <= 10:
    if кількість_сторін == 3:
        ім_я_фігури = "трикутник"
    elif кількість_сторін == 4:
        ім_я_фігури = "квадрат"
    elif кількість_сторін == 5:
        ім_я_фігури = "п'ятикутник"
    elif кількість_сторін == 6:
        ім_я_фігури = "шестикутник"

    print(f"Ця фігура має {кількість_сторін} сторін і називається {ім_я_фігури}.")
else:
    print("Помилка: Кількість сторін повинна бути від 3 до 10 включно.")
