'''
Трикутник можна класифікувати, виходячи з довжин його сторін, 
на рівносторонній, рівнобедрений або прямокутний. 
Всі три сторони рівностороннього трикутника мають однакову довжину. 
Рівнобедрений трикутник має дві сторони, які мають однакову довжину, 
і третю сторону, яка має різну довжину. Якщо всі сторони мають різну довжину, 
то трикутник рівносторонній.
Напишіть програму, яка зчитує довжини трьох сторін трикутника від користувача. 
Потім відобразіть повідомлення, в якому вказано тип трикутника.

'''

a = float(input("Введіть довжину першої сторони: "))
b = float(input("Введіть довжину другої сторони: "))
c = float(input("Введіть довжину третьої сторони: "))

if a == b == c:
    тип_трикутника = "рівносторонній"
elif a == b or b == c or c == a:
    тип_трикутника = "рівнобедрений"
else:
    тип_трикутника = "різносторонній"

print(f"Цей трикутник є {тип_трикутника}.")
