'''
Напишіть програму, яка починається з читання номіналу банкноти у користувача. 
Потім ваша програма повинна відобразити ім'я фізичної особи, 
яке фігурує на банкноті введеної суми. 
Відповідне повідомлення про помилку має відображатися, 
якщо такої банкноти немає.


'''

номінал_банкноти = int(input("Введіть номінал банкноти: "))

if номінал_банкноти == 1:
    ім_я_фігури = "Джордж Вашингтон"
elif номінал_банкноти == 2:
    ім_я_фігури = "Томас Джефферсон"
elif номінал_банкноти == 5:
    ім_я_фігури = "Авраам Лінкольн"
else:
    ім_я_фігури = "Невідома фігура"

print(f"На банкноті номіналом {номінал_банкноти} гривень може бути {ім_я_фігури}.")
