'''
Створіть програму, яка читає місяць і день від користувача.
Користувач введе назву місяця як рядок, а потім день у межах місяця як ціле число. 
Потім у вашій програмі повинен відобразитися сезон, пов'язаний з датою, 
яка була введена.

'''

місяць = input("Введіть назву місяця: ")
день = int(input("Введіть число у межах місяця: "))

if місяць.lower() in ["грудень", "січень", "лютий"]:
    сезон = "зима"
elif місяць.lower() in ["березень", "квітень", "травень"]:
    сезон = "весна"
elif місяць.lower() in ["червень", "липень", "серпень"]:
    сезон = "літо"
elif місяць.lower() in ["вересень", "жовтень", "листопад"]:
    сезон = "осінь"
else:
    сезон = "Невідомий місяць"

print(f"Сезон для {місяць} {день}-го числа - {сезон}.")
