'''
Напишіть програму, яка просить користувача ввести свій місяць і день народження. 
Потім ваша програма повинна повідомити знак зодіаку користувача як частину 
відповідного вихідного повідомлення.

Козеріг з 22 грудня по 19 січня
Водолій з 20 січня по 18 лютого
Риби з 19 лютого по 20 березня
Овен з 21 березня по 19 квітня
Телець з 20 квітня по 20 травня
Близнюки з 21 травня по 20 червня
Рак з 21 червня по 22 липня
Лев з 23 липня по 22 серпня
Діва з 23 серпня по 22 вересня
Терези з 23 вересня по 22 жовтня
Скорпіон з 23 жовтня по 21 листопада
Стрілець з 22 листопада по 21 грудня


'''

місяць = input("Введіть місяць народження: ")
день = int(input("Введіть число народження: "))

if (місяць.lower() == "грудень" and 22 <= день <= 31) or (місяць.lower() == "січень" and 1 <= день <= 19):
    знак_зодіаку = "Козеріг"
elif (місяць.lower() == "січень" and 20 <= день <= 31) or (місяць.lower() == "лютий" and 1 <= день <= 18):
    знак_зодіаку = "Водолій"
elif (місяць.lower() == "лютий" and 19 <= день <= 29) or (місяць.lower() == "березень" and 1 <= день <= 20):
    знак_зодіаку = "Риби"
elif (місяць.lower() == "березень" and 21 <= день <= 31) or (місяць.lower() == "квітень" and 1 <= день <= 19):
    знак_зодіаку = "Овен"
elif (місяць.lower() == "квітень" and 20 <= день <= 30) or (місяць.lower() == "травень" and 1 <= день <= 20):
    знак_зодіаку = "Телець"
elif (місяць.lower() == "травень" and 21 <= день <= 31) or (місяць.lower() == "червень" and 1 <= день <= 20):
    знак_зодіаку = "Близнюки"
elif (місяць.lower() == "червень" and 21 <= день <= 30) or (місяць.lower() == "липень" and 1 <= день <= 22):
    знак_зодіаку = "Рак"
elif (місяць.lower() == "липень" and 23 <= день <= 31) or (місяць.lower() == "серпень" and 1 <= день <= 22):
    знак_зодіаку = "Лев"
elif (місяць.lower() == "серпень" and 23 <= день <= 31) or (місяць.lower() == "вересень" and 1 <= день <= 22):
    знак_зодіаку = "Діва"
elif (місяць.lower() == "вересень" and 23 <= день <= 30) or (місяць.lower() == "жовтень" and 1 <= день <= 22):
    знак_зодіаку = "Терези"
elif (місяць.lower() == "жовтень" and 23 <= день <= 31) or (місяць.lower() == "листопад" and 1 <= день <= 21):
    знак_зодіаку = "Скорпіон"
elif (місяць.lower() == "листопад" and 22 <= день <= 30) or (місяць.lower() == "грудень" and 1 <= день <= 21):
    знак_зодіаку = "Стрілець"
else:
    знак_зодіаку = "Невідомий знак зодіаку"

print(f"Ваш знак зодіаку: {знак_зодіаку}.")
