'''
Напишіть програму, яка починається з читання буквеної оцінки від користувача. 
Потім ваша програма повинна обчислити та відобразити еквівалентну кількість 
балів оцінок. Переконайтеся, що програма створює відповідне повідомлення 
про помилку, якщо користувач вводить неприпустиму оцінку букв.

'''

буквена_оцінка = input("Введіть буквену оцінку: ")

if буквена_оцінка == "A":
    бали = 4.0
elif буквена_оцінка == "A-":
    бали = 3.7
elif буквена_оцінка == "B+":
    бали = 3.3
elif буквена_оцінка == "B":
    бали = 3.0
elif буквена_оцінка == "B-":
    бали = 2.7
elif буквена_оцінка == "C+":
    бали = 2.3
elif буквена_оцінка == "C":
    бали = 2.0
elif буквена_оцінка == "C-":
    бали = 1.7
elif буквена_оцінка == "D+":
    бали = 1.3
elif буквена_оцінка == "D":
    бали = 1.0
elif буквена_оцінка == "F":
    бали = 0.0
else:
    print("Помилка: Неприпустима буквена оцінка")

if "бали" in locals():
    print(f"Еквівалентні бали для оцінки {буквена_оцінка}: {бали}")
